src/Documents/ВыводИзЭксплуатации/ВыводИзЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыводИзЭксплуатации</name>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.ОснованияВыводаТовараИзЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ОснованияВыводаТовараИзЭксплуатации/ОснованияВыводаТовараИзЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОснованияВыводаТовараИзЭксплуатации</name>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>ПрофилактическиеРаботы</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ВыводИзЭксплуатации/ObjectModule.bsl
//@strict-types
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ТоварОбъект = Товар.ПолучитьОбъект();
	Если ТоварОбъект = Неопределено Или ТоварОбъект.Заблокирован() Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Данный товар заблокирован или уже удален.", "Товар", ЭтотОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТоварОбъект.Используется = Ложь;
	Если Основание = Перечисления.ОснованияВыводаТовараИзЭксплуатации.Списание Тогда
		ТоварОбъект.ДатаВыводаИзЭксплуатации = ТекущаяДатаСеанса();
	КонецЕсли;
	ТоварОбъект.Станция = Справочники.Станции.ПустаяСсылка();
	
	ТоварОбъект.Записать();
КонецПроцедуры
